// 1. Создайте класс исключения, который будет выбрасываться при делениина 0.
// Исключение должно отображать понятное для пользователя сообщение
// об ошибке.
// 2. Создайте класс исключений, которое будет возникать при обращении к
// пустому элементу в массиве ссылочного типа. Исключение должно отображать
// понятное для пользователя сообщениеоб ошибке.
// 3. Создайте класс исключения, которое будет возникать при попытке открыть
// несуществующий файл. Исключение должно отображать понятное для пользователя
// сообщение об ошибке.

package s3_task15;

public class Task15 {
}
